Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cm_sg00_curioisty_pro_trustzone/pic32cm_sg00/src/packs/PIC32CM5112SG00100_DFP/component/pac.h
/*
 * Component description for PAC
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2024-11-05T16:47:53Z  */
#ifndef _PIC32CMSG00_PAC_COMPONENT_H_
#define _PIC32CMSG00_PAC_COMPONENT_H_

/* ************************************************************************** */
/*                      SOFTWARE API DEFINITION FOR PAC                       */
/* ************************************************************************** */

/* -------- PAC_CTRLA : (PAC Offset: 0x00) (R/W 32) Control A Register -------- */
#define PAC_CTRLA_RESETVALUE                  _UINT32_(0x00)                                       /*  (PAC_CTRLA) Control A Register  Reset Value */

#define PAC_CTRLA_PRIV_Pos                    _UINT32_(2)                                          /* (PAC_CTRLA) Privileged Access Only Position */
#define PAC_CTRLA_PRIV_Msk                    (_UINT32_(0x1) << PAC_CTRLA_PRIV_Pos)                /* (PAC_CTRLA) Privileged Access Only Mask */
#define PAC_CTRLA_PRIV(value)                 (PAC_CTRLA_PRIV_Msk & (_UINT32_(value) << PAC_CTRLA_PRIV_Pos)) /* Assignment of value for PRIV in the PAC_CTRLA register */
#define   PAC_CTRLA_PRIV_DISABLE_Val          _UINT32_(0x0)                                        /* (PAC_CTRLA) Macro register accessible in privileged and unprivileged accesses.  */
#define   PAC_CTRLA_PRIV_ENABLE_Val           _UINT32_(0x1)                                        /* (PAC_CTRLA) Macro registers only accessible in privileged accesses  */
#define PAC_CTRLA_PRIV_DISABLE                (PAC_CTRLA_PRIV_DISABLE_Val << PAC_CTRLA_PRIV_Pos)   /* (PAC_CTRLA) Macro register accessible in privileged and unprivileged accesses. Position */
#define PAC_CTRLA_PRIV_ENABLE                 (PAC_CTRLA_PRIV_ENABLE_Val << PAC_CTRLA_PRIV_Pos)    /* (PAC_CTRLA) Macro registers only accessible in privileged accesses Position */
#define PAC_CTRLA_Msk                         _UINT32_(0x00000004)                                 /* (PAC_CTRLA) Register Mask  */


/* -------- PAC_WRCTRL : (PAC Offset: 0x04) ( /W 32) Write Control Register -------- */
#define PAC_WRCTRL_RESETVALUE                 _UINT32_(0x00)                                       /*  (PAC_WRCTRL) Write Control Register  Reset Value */

#define PAC_WRCTRL_PERID_Pos                  _UINT32_(0)                                          /* (PAC_WRCTRL) Peripheral Identifier Position */
#define PAC_WRCTRL_PERID_Msk                  (_UINT32_(0xFF) << PAC_WRCTRL_PERID_Pos)             /* (PAC_WRCTRL) Peripheral Identifier Mask */
#define PAC_WRCTRL_PERID(value)               (PAC_WRCTRL_PERID_Msk & (_UINT32_(value) << PAC_WRCTRL_PERID_Pos)) /* Assignment of value for PERID in the PAC_WRCTRL register */
#define PAC_WRCTRL_KEY_Pos                    _UINT32_(16)                                         /* (PAC_WRCTRL) Peripheral Access Control Key Position */
#define PAC_WRCTRL_KEY_Msk                    (_UINT32_(0xFF) << PAC_WRCTRL_KEY_Pos)               /* (PAC_WRCTRL) Peripheral Access Control Key Mask */
#define PAC_WRCTRL_KEY(value)                 (PAC_WRCTRL_KEY_Msk & (_UINT32_(value) << PAC_WRCTRL_KEY_Pos)) /* Assignment of value for KEY in the PAC_WRCTRL register */
#define   PAC_WRCTRL_KEY_OFF_Val              _UINT32_(0x0)                                        /* (PAC_WRCTRL) OFF - No Action  */
#define   PAC_WRCTRL_KEY_CLEAR_Val            _UINT32_(0x1)                                        /* (PAC_WRCTRL) CLEAR - Clear the peripheral write protection  */
#define   PAC_WRCTRL_KEY_SET_Val              _UINT32_(0x2)                                        /* (PAC_WRCTRL) SET - Set the peripheral write protection  */
#define   PAC_WRCTRL_KEY_LOCK_Val             _UINT32_(0x3)                                        /* (PAC_WRCTRL) LOCK - Set and Lock the write protection state of the peripheral until the next reset  */
#define PAC_WRCTRL_KEY_OFF                    (PAC_WRCTRL_KEY_OFF_Val << PAC_WRCTRL_KEY_Pos)       /* (PAC_WRCTRL) OFF - No Action Position */
#define PAC_WRCTRL_KEY_CLEAR                  (PAC_WRCTRL_KEY_CLEAR_Val << PAC_WRCTRL_KEY_Pos)     /* (PAC_WRCTRL) CLEAR - Clear the peripheral write protection Position */
#define PAC_WRCTRL_KEY_SET                    (PAC_WRCTRL_KEY_SET_Val << PAC_WRCTRL_KEY_Pos)       /* (PAC_WRCTRL) SET - Set the peripheral write protection Position */
#define PAC_WRCTRL_KEY_LOCK                   (PAC_WRCTRL_KEY_LOCK_Val << PAC_WRCTRL_KEY_Pos)      /* (PAC_WRCTRL) LOCK - Set and Lock the write protection state of the peripheral until the next reset Position */
#define PAC_WRCTRL_Msk                        _UINT32_(0x00FF00FF)                                 /* (PAC_WRCTRL) Register Mask  */


/* -------- PAC_STATUS : (PAC Offset: 0x40) ( R/ 32) Peripheral Status n Register -------- */
#define PAC_STATUS_RESETVALUE                 _UINT32_(0x00)                                       /*  (PAC_STATUS) Peripheral Status n Register  Reset Value */

#define PAC_STATUS_PERID0_Pos                 _UINT32_(0)                                          /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID0_Msk                 (_UINT32_(0x1) << PAC_STATUS_PERID0_Pos)             /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID0(value)              (PAC_STATUS_PERID0_Msk & (_UINT32_(value) << PAC_STATUS_PERID0_Pos)) /* Assignment of value for PERID0 in the PAC_STATUS register */
#define   PAC_STATUS_PERID0_0_Val             _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID0_1_Val             _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID0_0                   (PAC_STATUS_PERID0_0_Val << PAC_STATUS_PERID0_Pos)   /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID0_1                   (PAC_STATUS_PERID0_1_Val << PAC_STATUS_PERID0_Pos)   /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID1_Pos                 _UINT32_(1)                                          /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID1_Msk                 (_UINT32_(0x1) << PAC_STATUS_PERID1_Pos)             /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID1(value)              (PAC_STATUS_PERID1_Msk & (_UINT32_(value) << PAC_STATUS_PERID1_Pos)) /* Assignment of value for PERID1 in the PAC_STATUS register */
#define   PAC_STATUS_PERID1_0_Val             _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID1_1_Val             _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID1_0                   (PAC_STATUS_PERID1_0_Val << PAC_STATUS_PERID1_Pos)   /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID1_1                   (PAC_STATUS_PERID1_1_Val << PAC_STATUS_PERID1_Pos)   /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID2_Pos                 _UINT32_(2)                                          /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID2_Msk                 (_UINT32_(0x1) << PAC_STATUS_PERID2_Pos)             /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID2(value)              (PAC_STATUS_PERID2_Msk & (_UINT32_(value) << PAC_STATUS_PERID2_Pos)) /* Assignment of value for PERID2 in the PAC_STATUS register */
#define   PAC_STATUS_PERID2_0_Val             _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID2_1_Val             _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID2_0                   (PAC_STATUS_PERID2_0_Val << PAC_STATUS_PERID2_Pos)   /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID2_1                   (PAC_STATUS_PERID2_1_Val << PAC_STATUS_PERID2_Pos)   /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID3_Pos                 _UINT32_(3)                                          /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID3_Msk                 (_UINT32_(0x1) << PAC_STATUS_PERID3_Pos)             /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID3(value)              (PAC_STATUS_PERID3_Msk & (_UINT32_(value) << PAC_STATUS_PERID3_Pos)) /* Assignment of value for PERID3 in the PAC_STATUS register */
#define   PAC_STATUS_PERID3_0_Val             _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID3_1_Val             _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID3_0                   (PAC_STATUS_PERID3_0_Val << PAC_STATUS_PERID3_Pos)   /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID3_1                   (PAC_STATUS_PERID3_1_Val << PAC_STATUS_PERID3_Pos)   /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID4_Pos                 _UINT32_(4)                                          /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID4_Msk                 (_UINT32_(0x1) << PAC_STATUS_PERID4_Pos)             /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID4(value)              (PAC_STATUS_PERID4_Msk & (_UINT32_(value) << PAC_STATUS_PERID4_Pos)) /* Assignment of value for PERID4 in the PAC_STATUS register */
#define   PAC_STATUS_PERID4_0_Val             _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID4_1_Val             _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID4_0                   (PAC_STATUS_PERID4_0_Val << PAC_STATUS_PERID4_Pos)   /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID4_1                   (PAC_STATUS_PERID4_1_Val << PAC_STATUS_PERID4_Pos)   /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID5_Pos                 _UINT32_(5)                                          /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID5_Msk                 (_UINT32_(0x1) << PAC_STATUS_PERID5_Pos)             /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID5(value)              (PAC_STATUS_PERID5_Msk & (_UINT32_(value) << PAC_STATUS_PERID5_Pos)) /* Assignment of value for PERID5 in the PAC_STATUS register */
#define   PAC_STATUS_PERID5_0_Val             _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID5_1_Val             _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID5_0                   (PAC_STATUS_PERID5_0_Val << PAC_STATUS_PERID5_Pos)   /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID5_1                   (PAC_STATUS_PERID5_1_Val << PAC_STATUS_PERID5_Pos)   /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID6_Pos                 _UINT32_(6)                                          /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID6_Msk                 (_UINT32_(0x1) << PAC_STATUS_PERID6_Pos)             /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID6(value)              (PAC_STATUS_PERID6_Msk & (_UINT32_(value) << PAC_STATUS_PERID6_Pos)) /* Assignment of value for PERID6 in the PAC_STATUS register */
#define   PAC_STATUS_PERID6_0_Val             _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID6_1_Val             _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID6_0                   (PAC_STATUS_PERID6_0_Val << PAC_STATUS_PERID6_Pos)   /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID6_1                   (PAC_STATUS_PERID6_1_Val << PAC_STATUS_PERID6_Pos)   /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID7_Pos                 _UINT32_(7)                                          /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID7_Msk                 (_UINT32_(0x1) << PAC_STATUS_PERID7_Pos)             /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID7(value)              (PAC_STATUS_PERID7_Msk & (_UINT32_(value) << PAC_STATUS_PERID7_Pos)) /* Assignment of value for PERID7 in the PAC_STATUS register */
#define   PAC_STATUS_PERID7_0_Val             _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID7_1_Val             _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID7_0                   (PAC_STATUS_PERID7_0_Val << PAC_STATUS_PERID7_Pos)   /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID7_1                   (PAC_STATUS_PERID7_1_Val << PAC_STATUS_PERID7_Pos)   /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID8_Pos                 _UINT32_(8)                                          /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID8_Msk                 (_UINT32_(0x1) << PAC_STATUS_PERID8_Pos)             /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID8(value)              (PAC_STATUS_PERID8_Msk & (_UINT32_(value) << PAC_STATUS_PERID8_Pos)) /* Assignment of value for PERID8 in the PAC_STATUS register */
#define   PAC_STATUS_PERID8_0_Val             _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID8_1_Val             _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID8_0                   (PAC_STATUS_PERID8_0_Val << PAC_STATUS_PERID8_Pos)   /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID8_1                   (PAC_STATUS_PERID8_1_Val << PAC_STATUS_PERID8_Pos)   /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID9_Pos                 _UINT32_(9)                                          /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID9_Msk                 (_UINT32_(0x1) << PAC_STATUS_PERID9_Pos)             /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID9(value)              (PAC_STATUS_PERID9_Msk & (_UINT32_(value) << PAC_STATUS_PERID9_Pos)) /* Assignment of value for PERID9 in the PAC_STATUS register */
#define   PAC_STATUS_PERID9_0_Val             _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID9_1_Val             _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID9_0                   (PAC_STATUS_PERID9_0_Val << PAC_STATUS_PERID9_Pos)   /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID9_1                   (PAC_STATUS_PERID9_1_Val << PAC_STATUS_PERID9_Pos)   /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID10_Pos                _UINT32_(10)                                         /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID10_Msk                (_UINT32_(0x1) << PAC_STATUS_PERID10_Pos)            /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID10(value)             (PAC_STATUS_PERID10_Msk & (_UINT32_(value) << PAC_STATUS_PERID10_Pos)) /* Assignment of value for PERID10 in the PAC_STATUS register */
#define   PAC_STATUS_PERID10_0_Val            _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID10_1_Val            _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID10_0                  (PAC_STATUS_PERID10_0_Val << PAC_STATUS_PERID10_Pos) /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID10_1                  (PAC_STATUS_PERID10_1_Val << PAC_STATUS_PERID10_Pos) /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID11_Pos                _UINT32_(11)                                         /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID11_Msk                (_UINT32_(0x1) << PAC_STATUS_PERID11_Pos)            /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID11(value)             (PAC_STATUS_PERID11_Msk & (_UINT32_(value) << PAC_STATUS_PERID11_Pos)) /* Assignment of value for PERID11 in the PAC_STATUS register */
#define   PAC_STATUS_PERID11_0_Val            _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID11_1_Val            _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID11_0                  (PAC_STATUS_PERID11_0_Val << PAC_STATUS_PERID11_Pos) /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID11_1                  (PAC_STATUS_PERID11_1_Val << PAC_STATUS_PERID11_Pos) /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID12_Pos                _UINT32_(12)                                         /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID12_Msk                (_UINT32_(0x1) << PAC_STATUS_PERID12_Pos)            /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID12(value)             (PAC_STATUS_PERID12_Msk & (_UINT32_(value) << PAC_STATUS_PERID12_Pos)) /* Assignment of value for PERID12 in the PAC_STATUS register */
#define   PAC_STATUS_PERID12_0_Val            _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID12_1_Val            _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID12_0                  (PAC_STATUS_PERID12_0_Val << PAC_STATUS_PERID12_Pos) /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID12_1                  (PAC_STATUS_PERID12_1_Val << PAC_STATUS_PERID12_Pos) /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID13_Pos                _UINT32_(13)                                         /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID13_Msk                (_UINT32_(0x1) << PAC_STATUS_PERID13_Pos)            /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID13(value)             (PAC_STATUS_PERID13_Msk & (_UINT32_(value) << PAC_STATUS_PERID13_Pos)) /* Assignment of value for PERID13 in the PAC_STATUS register */
#define   PAC_STATUS_PERID13_0_Val            _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID13_1_Val            _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID13_0                  (PAC_STATUS_PERID13_0_Val << PAC_STATUS_PERID13_Pos) /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID13_1                  (PAC_STATUS_PERID13_1_Val << PAC_STATUS_PERID13_Pos) /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID14_Pos                _UINT32_(14)                                         /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID14_Msk                (_UINT32_(0x1) << PAC_STATUS_PERID14_Pos)            /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID14(value)             (PAC_STATUS_PERID14_Msk & (_UINT32_(value) << PAC_STATUS_PERID14_Pos)) /* Assignment of value for PERID14 in the PAC_STATUS register */
#define   PAC_STATUS_PERID14_0_Val            _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID14_1_Val            _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID14_0                  (PAC_STATUS_PERID14_0_Val << PAC_STATUS_PERID14_Pos) /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID14_1                  (PAC_STATUS_PERID14_1_Val << PAC_STATUS_PERID14_Pos) /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID15_Pos                _UINT32_(15)                                         /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID15_Msk                (_UINT32_(0x1) << PAC_STATUS_PERID15_Pos)            /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID15(value)             (PAC_STATUS_PERID15_Msk & (_UINT32_(value) << PAC_STATUS_PERID15_Pos)) /* Assignment of value for PERID15 in the PAC_STATUS register */
#define   PAC_STATUS_PERID15_0_Val            _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID15_1_Val            _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID15_0                  (PAC_STATUS_PERID15_0_Val << PAC_STATUS_PERID15_Pos) /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID15_1                  (PAC_STATUS_PERID15_1_Val << PAC_STATUS_PERID15_Pos) /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID16_Pos                _UINT32_(16)                                         /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID16_Msk                (_UINT32_(0x1) << PAC_STATUS_PERID16_Pos)            /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID16(value)             (PAC_STATUS_PERID16_Msk & (_UINT32_(value) << PAC_STATUS_PERID16_Pos)) /* Assignment of value for PERID16 in the PAC_STATUS register */
#define   PAC_STATUS_PERID16_0_Val            _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID16_1_Val            _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID16_0                  (PAC_STATUS_PERID16_0_Val << PAC_STATUS_PERID16_Pos) /* (PAC_STATUS) Write Protection disabled Position */
