Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cm_sg00_curioisty_pro_trustzone/pic32cm_sg00/src/packs/PIC32CM5112SG00100_DFP/component/pac.h
#define PAC_STATUS_PERID16_1                  (PAC_STATUS_PERID16_1_Val << PAC_STATUS_PERID16_Pos) /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID17_Pos                _UINT32_(17)                                         /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID17_Msk                (_UINT32_(0x1) << PAC_STATUS_PERID17_Pos)            /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID17(value)             (PAC_STATUS_PERID17_Msk & (_UINT32_(value) << PAC_STATUS_PERID17_Pos)) /* Assignment of value for PERID17 in the PAC_STATUS register */
#define   PAC_STATUS_PERID17_0_Val            _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID17_1_Val            _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID17_0                  (PAC_STATUS_PERID17_0_Val << PAC_STATUS_PERID17_Pos) /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID17_1                  (PAC_STATUS_PERID17_1_Val << PAC_STATUS_PERID17_Pos) /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID18_Pos                _UINT32_(18)                                         /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID18_Msk                (_UINT32_(0x1) << PAC_STATUS_PERID18_Pos)            /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID18(value)             (PAC_STATUS_PERID18_Msk & (_UINT32_(value) << PAC_STATUS_PERID18_Pos)) /* Assignment of value for PERID18 in the PAC_STATUS register */
#define   PAC_STATUS_PERID18_0_Val            _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID18_1_Val            _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID18_0                  (PAC_STATUS_PERID18_0_Val << PAC_STATUS_PERID18_Pos) /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID18_1                  (PAC_STATUS_PERID18_1_Val << PAC_STATUS_PERID18_Pos) /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID19_Pos                _UINT32_(19)                                         /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID19_Msk                (_UINT32_(0x1) << PAC_STATUS_PERID19_Pos)            /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID19(value)             (PAC_STATUS_PERID19_Msk & (_UINT32_(value) << PAC_STATUS_PERID19_Pos)) /* Assignment of value for PERID19 in the PAC_STATUS register */
#define   PAC_STATUS_PERID19_0_Val            _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID19_1_Val            _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID19_0                  (PAC_STATUS_PERID19_0_Val << PAC_STATUS_PERID19_Pos) /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID19_1                  (PAC_STATUS_PERID19_1_Val << PAC_STATUS_PERID19_Pos) /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID20_Pos                _UINT32_(20)                                         /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID20_Msk                (_UINT32_(0x1) << PAC_STATUS_PERID20_Pos)            /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID20(value)             (PAC_STATUS_PERID20_Msk & (_UINT32_(value) << PAC_STATUS_PERID20_Pos)) /* Assignment of value for PERID20 in the PAC_STATUS register */
#define   PAC_STATUS_PERID20_0_Val            _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID20_1_Val            _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID20_0                  (PAC_STATUS_PERID20_0_Val << PAC_STATUS_PERID20_Pos) /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID20_1                  (PAC_STATUS_PERID20_1_Val << PAC_STATUS_PERID20_Pos) /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID21_Pos                _UINT32_(21)                                         /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID21_Msk                (_UINT32_(0x1) << PAC_STATUS_PERID21_Pos)            /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID21(value)             (PAC_STATUS_PERID21_Msk & (_UINT32_(value) << PAC_STATUS_PERID21_Pos)) /* Assignment of value for PERID21 in the PAC_STATUS register */
#define   PAC_STATUS_PERID21_0_Val            _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID21_1_Val            _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID21_0                  (PAC_STATUS_PERID21_0_Val << PAC_STATUS_PERID21_Pos) /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID21_1                  (PAC_STATUS_PERID21_1_Val << PAC_STATUS_PERID21_Pos) /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID22_Pos                _UINT32_(22)                                         /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID22_Msk                (_UINT32_(0x1) << PAC_STATUS_PERID22_Pos)            /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID22(value)             (PAC_STATUS_PERID22_Msk & (_UINT32_(value) << PAC_STATUS_PERID22_Pos)) /* Assignment of value for PERID22 in the PAC_STATUS register */
#define   PAC_STATUS_PERID22_0_Val            _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID22_1_Val            _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID22_0                  (PAC_STATUS_PERID22_0_Val << PAC_STATUS_PERID22_Pos) /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID22_1                  (PAC_STATUS_PERID22_1_Val << PAC_STATUS_PERID22_Pos) /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID23_Pos                _UINT32_(23)                                         /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID23_Msk                (_UINT32_(0x1) << PAC_STATUS_PERID23_Pos)            /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID23(value)             (PAC_STATUS_PERID23_Msk & (_UINT32_(value) << PAC_STATUS_PERID23_Pos)) /* Assignment of value for PERID23 in the PAC_STATUS register */
#define   PAC_STATUS_PERID23_0_Val            _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID23_1_Val            _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID23_0                  (PAC_STATUS_PERID23_0_Val << PAC_STATUS_PERID23_Pos) /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID23_1                  (PAC_STATUS_PERID23_1_Val << PAC_STATUS_PERID23_Pos) /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID24_Pos                _UINT32_(24)                                         /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID24_Msk                (_UINT32_(0x1) << PAC_STATUS_PERID24_Pos)            /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID24(value)             (PAC_STATUS_PERID24_Msk & (_UINT32_(value) << PAC_STATUS_PERID24_Pos)) /* Assignment of value for PERID24 in the PAC_STATUS register */
#define   PAC_STATUS_PERID24_0_Val            _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID24_1_Val            _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID24_0                  (PAC_STATUS_PERID24_0_Val << PAC_STATUS_PERID24_Pos) /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID24_1                  (PAC_STATUS_PERID24_1_Val << PAC_STATUS_PERID24_Pos) /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID25_Pos                _UINT32_(25)                                         /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID25_Msk                (_UINT32_(0x1) << PAC_STATUS_PERID25_Pos)            /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID25(value)             (PAC_STATUS_PERID25_Msk & (_UINT32_(value) << PAC_STATUS_PERID25_Pos)) /* Assignment of value for PERID25 in the PAC_STATUS register */
#define   PAC_STATUS_PERID25_0_Val            _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID25_1_Val            _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID25_0                  (PAC_STATUS_PERID25_0_Val << PAC_STATUS_PERID25_Pos) /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID25_1                  (PAC_STATUS_PERID25_1_Val << PAC_STATUS_PERID25_Pos) /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID26_Pos                _UINT32_(26)                                         /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID26_Msk                (_UINT32_(0x1) << PAC_STATUS_PERID26_Pos)            /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID26(value)             (PAC_STATUS_PERID26_Msk & (_UINT32_(value) << PAC_STATUS_PERID26_Pos)) /* Assignment of value for PERID26 in the PAC_STATUS register */
#define   PAC_STATUS_PERID26_0_Val            _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID26_1_Val            _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID26_0                  (PAC_STATUS_PERID26_0_Val << PAC_STATUS_PERID26_Pos) /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID26_1                  (PAC_STATUS_PERID26_1_Val << PAC_STATUS_PERID26_Pos) /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID27_Pos                _UINT32_(27)                                         /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID27_Msk                (_UINT32_(0x1) << PAC_STATUS_PERID27_Pos)            /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID27(value)             (PAC_STATUS_PERID27_Msk & (_UINT32_(value) << PAC_STATUS_PERID27_Pos)) /* Assignment of value for PERID27 in the PAC_STATUS register */
#define   PAC_STATUS_PERID27_0_Val            _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID27_1_Val            _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID27_0                  (PAC_STATUS_PERID27_0_Val << PAC_STATUS_PERID27_Pos) /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID27_1                  (PAC_STATUS_PERID27_1_Val << PAC_STATUS_PERID27_Pos) /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID28_Pos                _UINT32_(28)                                         /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID28_Msk                (_UINT32_(0x1) << PAC_STATUS_PERID28_Pos)            /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID28(value)             (PAC_STATUS_PERID28_Msk & (_UINT32_(value) << PAC_STATUS_PERID28_Pos)) /* Assignment of value for PERID28 in the PAC_STATUS register */
#define   PAC_STATUS_PERID28_0_Val            _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID28_1_Val            _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID28_0                  (PAC_STATUS_PERID28_0_Val << PAC_STATUS_PERID28_Pos) /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID28_1                  (PAC_STATUS_PERID28_1_Val << PAC_STATUS_PERID28_Pos) /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID29_Pos                _UINT32_(29)                                         /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID29_Msk                (_UINT32_(0x1) << PAC_STATUS_PERID29_Pos)            /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID29(value)             (PAC_STATUS_PERID29_Msk & (_UINT32_(value) << PAC_STATUS_PERID29_Pos)) /* Assignment of value for PERID29 in the PAC_STATUS register */
#define   PAC_STATUS_PERID29_0_Val            _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID29_1_Val            _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID29_0                  (PAC_STATUS_PERID29_0_Val << PAC_STATUS_PERID29_Pos) /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID29_1                  (PAC_STATUS_PERID29_1_Val << PAC_STATUS_PERID29_Pos) /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID30_Pos                _UINT32_(30)                                         /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID30_Msk                (_UINT32_(0x1) << PAC_STATUS_PERID30_Pos)            /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID30(value)             (PAC_STATUS_PERID30_Msk & (_UINT32_(value) << PAC_STATUS_PERID30_Pos)) /* Assignment of value for PERID30 in the PAC_STATUS register */
#define   PAC_STATUS_PERID30_0_Val            _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID30_1_Val            _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID30_0                  (PAC_STATUS_PERID30_0_Val << PAC_STATUS_PERID30_Pos) /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID30_1                  (PAC_STATUS_PERID30_1_Val << PAC_STATUS_PERID30_Pos) /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_PERID31_Pos                _UINT32_(31)                                         /* (PAC_STATUS) PERID Write Protection Status Position */
#define PAC_STATUS_PERID31_Msk                (_UINT32_(0x1) << PAC_STATUS_PERID31_Pos)            /* (PAC_STATUS) PERID Write Protection Status Mask */
#define PAC_STATUS_PERID31(value)             (PAC_STATUS_PERID31_Msk & (_UINT32_(value) << PAC_STATUS_PERID31_Pos)) /* Assignment of value for PERID31 in the PAC_STATUS register */
#define   PAC_STATUS_PERID31_0_Val            _UINT32_(0x0)                                        /* (PAC_STATUS) Write Protection disabled  */
#define   PAC_STATUS_PERID31_1_Val            _UINT32_(0x1)                                        /* (PAC_STATUS) Write Protection enabled  */
#define PAC_STATUS_PERID31_0                  (PAC_STATUS_PERID31_0_Val << PAC_STATUS_PERID31_Pos) /* (PAC_STATUS) Write Protection disabled Position */
#define PAC_STATUS_PERID31_1                  (PAC_STATUS_PERID31_1_Val << PAC_STATUS_PERID31_Pos) /* (PAC_STATUS) Write Protection enabled Position */
#define PAC_STATUS_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (PAC_STATUS) Register Mask  */

#define PAC_STATUS_PERID_Pos                  _UINT32_(0)                                          /* (PAC_STATUS Position) PERID Write Protection Status */
#define PAC_STATUS_PERID_Msk                  (_UINT32_(0xFFFFFFFF) << PAC_STATUS_PERID_Pos)       /* (PAC_STATUS Mask) PERID */
#define PAC_STATUS_PERID(value)               (PAC_STATUS_PERID_Msk & (_UINT32_(value) << PAC_STATUS_PERID_Pos)) 

/* -------- PAC_LOCK : (PAC Offset: 0x50) ( R/ 32) Peripheral Lock n Register -------- */
#define PAC_LOCK_RESETVALUE                   _UINT32_(0x00)                                       /*  (PAC_LOCK) Peripheral Lock n Register  Reset Value */

