Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cm_sg00_curioisty_pro_trustzone/pic32cm_sg00/src/packs/PIC32CM5112SG00100_DFP/component/pac.h
#define PAC_LOCK_PERID0_Pos                   _UINT32_(0)                                          /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID0_Msk                   (_UINT32_(0x1) << PAC_LOCK_PERID0_Pos)               /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID0(value)                (PAC_LOCK_PERID0_Msk & (_UINT32_(value) << PAC_LOCK_PERID0_Pos)) /* Assignment of value for PERID0 in the PAC_LOCK register */
#define   PAC_LOCK_PERID0_0_Val               _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID0_1_Val               _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID0_0                     (PAC_LOCK_PERID0_0_Val << PAC_LOCK_PERID0_Pos)       /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID0_1                     (PAC_LOCK_PERID0_1_Val << PAC_LOCK_PERID0_Pos)       /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID1_Pos                   _UINT32_(1)                                          /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID1_Msk                   (_UINT32_(0x1) << PAC_LOCK_PERID1_Pos)               /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID1(value)                (PAC_LOCK_PERID1_Msk & (_UINT32_(value) << PAC_LOCK_PERID1_Pos)) /* Assignment of value for PERID1 in the PAC_LOCK register */
#define   PAC_LOCK_PERID1_0_Val               _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID1_1_Val               _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID1_0                     (PAC_LOCK_PERID1_0_Val << PAC_LOCK_PERID1_Pos)       /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID1_1                     (PAC_LOCK_PERID1_1_Val << PAC_LOCK_PERID1_Pos)       /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID2_Pos                   _UINT32_(2)                                          /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID2_Msk                   (_UINT32_(0x1) << PAC_LOCK_PERID2_Pos)               /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID2(value)                (PAC_LOCK_PERID2_Msk & (_UINT32_(value) << PAC_LOCK_PERID2_Pos)) /* Assignment of value for PERID2 in the PAC_LOCK register */
#define   PAC_LOCK_PERID2_0_Val               _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID2_1_Val               _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID2_0                     (PAC_LOCK_PERID2_0_Val << PAC_LOCK_PERID2_Pos)       /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID2_1                     (PAC_LOCK_PERID2_1_Val << PAC_LOCK_PERID2_Pos)       /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID3_Pos                   _UINT32_(3)                                          /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID3_Msk                   (_UINT32_(0x1) << PAC_LOCK_PERID3_Pos)               /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID3(value)                (PAC_LOCK_PERID3_Msk & (_UINT32_(value) << PAC_LOCK_PERID3_Pos)) /* Assignment of value for PERID3 in the PAC_LOCK register */
#define   PAC_LOCK_PERID3_0_Val               _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID3_1_Val               _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID3_0                     (PAC_LOCK_PERID3_0_Val << PAC_LOCK_PERID3_Pos)       /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID3_1                     (PAC_LOCK_PERID3_1_Val << PAC_LOCK_PERID3_Pos)       /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID4_Pos                   _UINT32_(4)                                          /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID4_Msk                   (_UINT32_(0x1) << PAC_LOCK_PERID4_Pos)               /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID4(value)                (PAC_LOCK_PERID4_Msk & (_UINT32_(value) << PAC_LOCK_PERID4_Pos)) /* Assignment of value for PERID4 in the PAC_LOCK register */
#define   PAC_LOCK_PERID4_0_Val               _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID4_1_Val               _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID4_0                     (PAC_LOCK_PERID4_0_Val << PAC_LOCK_PERID4_Pos)       /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID4_1                     (PAC_LOCK_PERID4_1_Val << PAC_LOCK_PERID4_Pos)       /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID5_Pos                   _UINT32_(5)                                          /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID5_Msk                   (_UINT32_(0x1) << PAC_LOCK_PERID5_Pos)               /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID5(value)                (PAC_LOCK_PERID5_Msk & (_UINT32_(value) << PAC_LOCK_PERID5_Pos)) /* Assignment of value for PERID5 in the PAC_LOCK register */
#define   PAC_LOCK_PERID5_0_Val               _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID5_1_Val               _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID5_0                     (PAC_LOCK_PERID5_0_Val << PAC_LOCK_PERID5_Pos)       /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID5_1                     (PAC_LOCK_PERID5_1_Val << PAC_LOCK_PERID5_Pos)       /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID6_Pos                   _UINT32_(6)                                          /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID6_Msk                   (_UINT32_(0x1) << PAC_LOCK_PERID6_Pos)               /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID6(value)                (PAC_LOCK_PERID6_Msk & (_UINT32_(value) << PAC_LOCK_PERID6_Pos)) /* Assignment of value for PERID6 in the PAC_LOCK register */
#define   PAC_LOCK_PERID6_0_Val               _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID6_1_Val               _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID6_0                     (PAC_LOCK_PERID6_0_Val << PAC_LOCK_PERID6_Pos)       /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID6_1                     (PAC_LOCK_PERID6_1_Val << PAC_LOCK_PERID6_Pos)       /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID7_Pos                   _UINT32_(7)                                          /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID7_Msk                   (_UINT32_(0x1) << PAC_LOCK_PERID7_Pos)               /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID7(value)                (PAC_LOCK_PERID7_Msk & (_UINT32_(value) << PAC_LOCK_PERID7_Pos)) /* Assignment of value for PERID7 in the PAC_LOCK register */
#define   PAC_LOCK_PERID7_0_Val               _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID7_1_Val               _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID7_0                     (PAC_LOCK_PERID7_0_Val << PAC_LOCK_PERID7_Pos)       /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID7_1                     (PAC_LOCK_PERID7_1_Val << PAC_LOCK_PERID7_Pos)       /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID8_Pos                   _UINT32_(8)                                          /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID8_Msk                   (_UINT32_(0x1) << PAC_LOCK_PERID8_Pos)               /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID8(value)                (PAC_LOCK_PERID8_Msk & (_UINT32_(value) << PAC_LOCK_PERID8_Pos)) /* Assignment of value for PERID8 in the PAC_LOCK register */
#define   PAC_LOCK_PERID8_0_Val               _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID8_1_Val               _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID8_0                     (PAC_LOCK_PERID8_0_Val << PAC_LOCK_PERID8_Pos)       /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID8_1                     (PAC_LOCK_PERID8_1_Val << PAC_LOCK_PERID8_Pos)       /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID9_Pos                   _UINT32_(9)                                          /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID9_Msk                   (_UINT32_(0x1) << PAC_LOCK_PERID9_Pos)               /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID9(value)                (PAC_LOCK_PERID9_Msk & (_UINT32_(value) << PAC_LOCK_PERID9_Pos)) /* Assignment of value for PERID9 in the PAC_LOCK register */
#define   PAC_LOCK_PERID9_0_Val               _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID9_1_Val               _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID9_0                     (PAC_LOCK_PERID9_0_Val << PAC_LOCK_PERID9_Pos)       /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID9_1                     (PAC_LOCK_PERID9_1_Val << PAC_LOCK_PERID9_Pos)       /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID10_Pos                  _UINT32_(10)                                         /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID10_Msk                  (_UINT32_(0x1) << PAC_LOCK_PERID10_Pos)              /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID10(value)               (PAC_LOCK_PERID10_Msk & (_UINT32_(value) << PAC_LOCK_PERID10_Pos)) /* Assignment of value for PERID10 in the PAC_LOCK register */
#define   PAC_LOCK_PERID10_0_Val              _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID10_1_Val              _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID10_0                    (PAC_LOCK_PERID10_0_Val << PAC_LOCK_PERID10_Pos)     /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID10_1                    (PAC_LOCK_PERID10_1_Val << PAC_LOCK_PERID10_Pos)     /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID11_Pos                  _UINT32_(11)                                         /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID11_Msk                  (_UINT32_(0x1) << PAC_LOCK_PERID11_Pos)              /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID11(value)               (PAC_LOCK_PERID11_Msk & (_UINT32_(value) << PAC_LOCK_PERID11_Pos)) /* Assignment of value for PERID11 in the PAC_LOCK register */
#define   PAC_LOCK_PERID11_0_Val              _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID11_1_Val              _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID11_0                    (PAC_LOCK_PERID11_0_Val << PAC_LOCK_PERID11_Pos)     /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID11_1                    (PAC_LOCK_PERID11_1_Val << PAC_LOCK_PERID11_Pos)     /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID12_Pos                  _UINT32_(12)                                         /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID12_Msk                  (_UINT32_(0x1) << PAC_LOCK_PERID12_Pos)              /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID12(value)               (PAC_LOCK_PERID12_Msk & (_UINT32_(value) << PAC_LOCK_PERID12_Pos)) /* Assignment of value for PERID12 in the PAC_LOCK register */
#define   PAC_LOCK_PERID12_0_Val              _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID12_1_Val              _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID12_0                    (PAC_LOCK_PERID12_0_Val << PAC_LOCK_PERID12_Pos)     /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID12_1                    (PAC_LOCK_PERID12_1_Val << PAC_LOCK_PERID12_Pos)     /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID13_Pos                  _UINT32_(13)                                         /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID13_Msk                  (_UINT32_(0x1) << PAC_LOCK_PERID13_Pos)              /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID13(value)               (PAC_LOCK_PERID13_Msk & (_UINT32_(value) << PAC_LOCK_PERID13_Pos)) /* Assignment of value for PERID13 in the PAC_LOCK register */
#define   PAC_LOCK_PERID13_0_Val              _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID13_1_Val              _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID13_0                    (PAC_LOCK_PERID13_0_Val << PAC_LOCK_PERID13_Pos)     /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID13_1                    (PAC_LOCK_PERID13_1_Val << PAC_LOCK_PERID13_Pos)     /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID14_Pos                  _UINT32_(14)                                         /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID14_Msk                  (_UINT32_(0x1) << PAC_LOCK_PERID14_Pos)              /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID14(value)               (PAC_LOCK_PERID14_Msk & (_UINT32_(value) << PAC_LOCK_PERID14_Pos)) /* Assignment of value for PERID14 in the PAC_LOCK register */
#define   PAC_LOCK_PERID14_0_Val              _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID14_1_Val              _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID14_0                    (PAC_LOCK_PERID14_0_Val << PAC_LOCK_PERID14_Pos)     /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID14_1                    (PAC_LOCK_PERID14_1_Val << PAC_LOCK_PERID14_Pos)     /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID15_Pos                  _UINT32_(15)                                         /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID15_Msk                  (_UINT32_(0x1) << PAC_LOCK_PERID15_Pos)              /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID15(value)               (PAC_LOCK_PERID15_Msk & (_UINT32_(value) << PAC_LOCK_PERID15_Pos)) /* Assignment of value for PERID15 in the PAC_LOCK register */
#define   PAC_LOCK_PERID15_0_Val              _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID15_1_Val              _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID15_0                    (PAC_LOCK_PERID15_0_Val << PAC_LOCK_PERID15_Pos)     /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID15_1                    (PAC_LOCK_PERID15_1_Val << PAC_LOCK_PERID15_Pos)     /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID16_Pos                  _UINT32_(16)                                         /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID16_Msk                  (_UINT32_(0x1) << PAC_LOCK_PERID16_Pos)              /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID16(value)               (PAC_LOCK_PERID16_Msk & (_UINT32_(value) << PAC_LOCK_PERID16_Pos)) /* Assignment of value for PERID16 in the PAC_LOCK register */
#define   PAC_LOCK_PERID16_0_Val              _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID16_1_Val              _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID16_0                    (PAC_LOCK_PERID16_0_Val << PAC_LOCK_PERID16_Pos)     /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID16_1                    (PAC_LOCK_PERID16_1_Val << PAC_LOCK_PERID16_Pos)     /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID17_Pos                  _UINT32_(17)                                         /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID17_Msk                  (_UINT32_(0x1) << PAC_LOCK_PERID17_Pos)              /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID17(value)               (PAC_LOCK_PERID17_Msk & (_UINT32_(value) << PAC_LOCK_PERID17_Pos)) /* Assignment of value for PERID17 in the PAC_LOCK register */
#define   PAC_LOCK_PERID17_0_Val              _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID17_1_Val              _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID17_0                    (PAC_LOCK_PERID17_0_Val << PAC_LOCK_PERID17_Pos)     /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID17_1                    (PAC_LOCK_PERID17_1_Val << PAC_LOCK_PERID17_Pos)     /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID18_Pos                  _UINT32_(18)                                         /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID18_Msk                  (_UINT32_(0x1) << PAC_LOCK_PERID18_Pos)              /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID18(value)               (PAC_LOCK_PERID18_Msk & (_UINT32_(value) << PAC_LOCK_PERID18_Pos)) /* Assignment of value for PERID18 in the PAC_LOCK register */
#define   PAC_LOCK_PERID18_0_Val              _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID18_1_Val              _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID18_0                    (PAC_LOCK_PERID18_0_Val << PAC_LOCK_PERID18_Pos)     /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID18_1                    (PAC_LOCK_PERID18_1_Val << PAC_LOCK_PERID18_Pos)     /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID19_Pos                  _UINT32_(19)                                         /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID19_Msk                  (_UINT32_(0x1) << PAC_LOCK_PERID19_Pos)              /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID19(value)               (PAC_LOCK_PERID19_Msk & (_UINT32_(value) << PAC_LOCK_PERID19_Pos)) /* Assignment of value for PERID19 in the PAC_LOCK register */
#define   PAC_LOCK_PERID19_0_Val              _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID19_1_Val              _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID19_0                    (PAC_LOCK_PERID19_0_Val << PAC_LOCK_PERID19_Pos)     /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID19_1                    (PAC_LOCK_PERID19_1_Val << PAC_LOCK_PERID19_Pos)     /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID20_Pos                  _UINT32_(20)                                         /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID20_Msk                  (_UINT32_(0x1) << PAC_LOCK_PERID20_Pos)              /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID20(value)               (PAC_LOCK_PERID20_Msk & (_UINT32_(value) << PAC_LOCK_PERID20_Pos)) /* Assignment of value for PERID20 in the PAC_LOCK register */
#define   PAC_LOCK_PERID20_0_Val              _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID20_1_Val              _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID20_0                    (PAC_LOCK_PERID20_0_Val << PAC_LOCK_PERID20_Pos)     /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID20_1                    (PAC_LOCK_PERID20_1_Val << PAC_LOCK_PERID20_Pos)     /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID21_Pos                  _UINT32_(21)                                         /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID21_Msk                  (_UINT32_(0x1) << PAC_LOCK_PERID21_Pos)              /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID21(value)               (PAC_LOCK_PERID21_Msk & (_UINT32_(value) << PAC_LOCK_PERID21_Pos)) /* Assignment of value for PERID21 in the PAC_LOCK register */
#define   PAC_LOCK_PERID21_0_Val              _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID21_1_Val              _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID21_0                    (PAC_LOCK_PERID21_0_Val << PAC_LOCK_PERID21_Pos)     /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID21_1                    (PAC_LOCK_PERID21_1_Val << PAC_LOCK_PERID21_Pos)     /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID22_Pos                  _UINT32_(22)                                         /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID22_Msk                  (_UINT32_(0x1) << PAC_LOCK_PERID22_Pos)              /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
