Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cm_sg00_curioisty_pro_trustzone/pic32cm_sg00/src/packs/PIC32CM5112SG00100_DFP/component/pac.h
#define PAC_LOCK_PERID22(value)               (PAC_LOCK_PERID22_Msk & (_UINT32_(value) << PAC_LOCK_PERID22_Pos)) /* Assignment of value for PERID22 in the PAC_LOCK register */
#define   PAC_LOCK_PERID22_0_Val              _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID22_1_Val              _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID22_0                    (PAC_LOCK_PERID22_0_Val << PAC_LOCK_PERID22_Pos)     /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID22_1                    (PAC_LOCK_PERID22_1_Val << PAC_LOCK_PERID22_Pos)     /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID23_Pos                  _UINT32_(23)                                         /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID23_Msk                  (_UINT32_(0x1) << PAC_LOCK_PERID23_Pos)              /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID23(value)               (PAC_LOCK_PERID23_Msk & (_UINT32_(value) << PAC_LOCK_PERID23_Pos)) /* Assignment of value for PERID23 in the PAC_LOCK register */
#define   PAC_LOCK_PERID23_0_Val              _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID23_1_Val              _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID23_0                    (PAC_LOCK_PERID23_0_Val << PAC_LOCK_PERID23_Pos)     /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID23_1                    (PAC_LOCK_PERID23_1_Val << PAC_LOCK_PERID23_Pos)     /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID24_Pos                  _UINT32_(24)                                         /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID24_Msk                  (_UINT32_(0x1) << PAC_LOCK_PERID24_Pos)              /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID24(value)               (PAC_LOCK_PERID24_Msk & (_UINT32_(value) << PAC_LOCK_PERID24_Pos)) /* Assignment of value for PERID24 in the PAC_LOCK register */
#define   PAC_LOCK_PERID24_0_Val              _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID24_1_Val              _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID24_0                    (PAC_LOCK_PERID24_0_Val << PAC_LOCK_PERID24_Pos)     /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID24_1                    (PAC_LOCK_PERID24_1_Val << PAC_LOCK_PERID24_Pos)     /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID25_Pos                  _UINT32_(25)                                         /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID25_Msk                  (_UINT32_(0x1) << PAC_LOCK_PERID25_Pos)              /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID25(value)               (PAC_LOCK_PERID25_Msk & (_UINT32_(value) << PAC_LOCK_PERID25_Pos)) /* Assignment of value for PERID25 in the PAC_LOCK register */
#define   PAC_LOCK_PERID25_0_Val              _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID25_1_Val              _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID25_0                    (PAC_LOCK_PERID25_0_Val << PAC_LOCK_PERID25_Pos)     /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID25_1                    (PAC_LOCK_PERID25_1_Val << PAC_LOCK_PERID25_Pos)     /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID26_Pos                  _UINT32_(26)                                         /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID26_Msk                  (_UINT32_(0x1) << PAC_LOCK_PERID26_Pos)              /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID26(value)               (PAC_LOCK_PERID26_Msk & (_UINT32_(value) << PAC_LOCK_PERID26_Pos)) /* Assignment of value for PERID26 in the PAC_LOCK register */
#define   PAC_LOCK_PERID26_0_Val              _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID26_1_Val              _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID26_0                    (PAC_LOCK_PERID26_0_Val << PAC_LOCK_PERID26_Pos)     /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID26_1                    (PAC_LOCK_PERID26_1_Val << PAC_LOCK_PERID26_Pos)     /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID27_Pos                  _UINT32_(27)                                         /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID27_Msk                  (_UINT32_(0x1) << PAC_LOCK_PERID27_Pos)              /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID27(value)               (PAC_LOCK_PERID27_Msk & (_UINT32_(value) << PAC_LOCK_PERID27_Pos)) /* Assignment of value for PERID27 in the PAC_LOCK register */
#define   PAC_LOCK_PERID27_0_Val              _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID27_1_Val              _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID27_0                    (PAC_LOCK_PERID27_0_Val << PAC_LOCK_PERID27_Pos)     /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID27_1                    (PAC_LOCK_PERID27_1_Val << PAC_LOCK_PERID27_Pos)     /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID28_Pos                  _UINT32_(28)                                         /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID28_Msk                  (_UINT32_(0x1) << PAC_LOCK_PERID28_Pos)              /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID28(value)               (PAC_LOCK_PERID28_Msk & (_UINT32_(value) << PAC_LOCK_PERID28_Pos)) /* Assignment of value for PERID28 in the PAC_LOCK register */
#define   PAC_LOCK_PERID28_0_Val              _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID28_1_Val              _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID28_0                    (PAC_LOCK_PERID28_0_Val << PAC_LOCK_PERID28_Pos)     /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID28_1                    (PAC_LOCK_PERID28_1_Val << PAC_LOCK_PERID28_Pos)     /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID29_Pos                  _UINT32_(29)                                         /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID29_Msk                  (_UINT32_(0x1) << PAC_LOCK_PERID29_Pos)              /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID29(value)               (PAC_LOCK_PERID29_Msk & (_UINT32_(value) << PAC_LOCK_PERID29_Pos)) /* Assignment of value for PERID29 in the PAC_LOCK register */
#define   PAC_LOCK_PERID29_0_Val              _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID29_1_Val              _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID29_0                    (PAC_LOCK_PERID29_0_Val << PAC_LOCK_PERID29_Pos)     /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID29_1                    (PAC_LOCK_PERID29_1_Val << PAC_LOCK_PERID29_Pos)     /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID30_Pos                  _UINT32_(30)                                         /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID30_Msk                  (_UINT32_(0x1) << PAC_LOCK_PERID30_Pos)              /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID30(value)               (PAC_LOCK_PERID30_Msk & (_UINT32_(value) << PAC_LOCK_PERID30_Pos)) /* Assignment of value for PERID30 in the PAC_LOCK register */
#define   PAC_LOCK_PERID30_0_Val              _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID30_1_Val              _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID30_0                    (PAC_LOCK_PERID30_0_Val << PAC_LOCK_PERID30_Pos)     /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID30_1                    (PAC_LOCK_PERID30_1_Val << PAC_LOCK_PERID30_Pos)     /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_PERID31_Pos                  _UINT32_(31)                                         /* (PAC_LOCK) PERID Write Protection Lock Status Position */
#define PAC_LOCK_PERID31_Msk                  (_UINT32_(0x1) << PAC_LOCK_PERID31_Pos)              /* (PAC_LOCK) PERID Write Protection Lock Status Mask */
#define PAC_LOCK_PERID31(value)               (PAC_LOCK_PERID31_Msk & (_UINT32_(value) << PAC_LOCK_PERID31_Pos)) /* Assignment of value for PERID31 in the PAC_LOCK register */
#define   PAC_LOCK_PERID31_0_Val              _UINT32_(0x0)                                        /* (PAC_LOCK) Write Protection Unlocked  */
#define   PAC_LOCK_PERID31_1_Val              _UINT32_(0x1)                                        /* (PAC_LOCK) Write Protection Locked  */
#define PAC_LOCK_PERID31_0                    (PAC_LOCK_PERID31_0_Val << PAC_LOCK_PERID31_Pos)     /* (PAC_LOCK) Write Protection Unlocked Position */
#define PAC_LOCK_PERID31_1                    (PAC_LOCK_PERID31_1_Val << PAC_LOCK_PERID31_Pos)     /* (PAC_LOCK) Write Protection Locked Position */
#define PAC_LOCK_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (PAC_LOCK) Register Mask  */

