Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cm_sg00_curioisty_pro_trustzone/pic32cm_sg00/src/packs/PIC32CM5112SG00100_DFP/component/pac.h
#define PAC_LOCK_PERID_Pos                    _UINT32_(0)                                          /* (PAC_LOCK Position) PERID Write Protection Lock Status */
#define PAC_LOCK_PERID_Msk                    (_UINT32_(0xFFFFFFFF) << PAC_LOCK_PERID_Pos)         /* (PAC_LOCK Mask) PERID */
#define PAC_LOCK_PERID(value)                 (PAC_LOCK_PERID_Msk & (_UINT32_(value) << PAC_LOCK_PERID_Pos)) 

/* PAC register offsets definitions */
#define PAC_CTRLA_REG_OFST             _UINT32_(0x00)      /* (PAC_CTRLA) Control A Register Offset */
#define PAC_WRCTRL_REG_OFST            _UINT32_(0x04)      /* (PAC_WRCTRL) Write Control Register Offset */
#define PAC_STATUS_REG_OFST            _UINT32_(0x40)      /* (PAC_STATUS) Peripheral Status n Register Offset */
#define PAC_STATUS0_REG_OFST           _UINT32_(0x40)      /* (PAC_STATUS0) Peripheral Status n Register Offset */
#define PAC_STATUS1_REG_OFST           _UINT32_(0x44)      /* (PAC_STATUS1) Peripheral Status n Register Offset */
#define PAC_STATUS2_REG_OFST           _UINT32_(0x48)      /* (PAC_STATUS2) Peripheral Status n Register Offset */
#define PAC_STATUS3_REG_OFST           _UINT32_(0x4C)      /* (PAC_STATUS3) Peripheral Status n Register Offset */
#define PAC_LOCK_REG_OFST              _UINT32_(0x50)      /* (PAC_LOCK) Peripheral Lock n Register Offset */
#define PAC_LOCK0_REG_OFST             _UINT32_(0x50)      /* (PAC_LOCK0) Peripheral Lock n Register Offset */
#define PAC_LOCK1_REG_OFST             _UINT32_(0x54)      /* (PAC_LOCK1) Peripheral Lock n Register Offset */
#define PAC_LOCK2_REG_OFST             _UINT32_(0x58)      /* (PAC_LOCK2) Peripheral Lock n Register Offset */
#define PAC_LOCK3_REG_OFST             _UINT32_(0x5C)      /* (PAC_LOCK3) Peripheral Lock n Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* PAC register API structure */
typedef struct
{  /* Peripheral Access Controller */
  __IO  uint32_t                       PAC_CTRLA;          /* Offset: 0x00 (R/W  32) Control A Register */
  __O   uint32_t                       PAC_WRCTRL;         /* Offset: 0x04 ( /W  32) Write Control Register */
  __I   uint8_t                        Reserved1[0x38];
  __I   uint32_t                       PAC_STATUS[4];      /* Offset: 0x40 (R/   32) Peripheral Status n Register */
  __I   uint32_t                       PAC_LOCK[4];        /* Offset: 0x50 (R/   32) Peripheral Lock n Register */
} pac_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMSG00_PAC_COMPONENT_H_ */
